app/views/comments/_form.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
<table>
  <% book.book_comments.each do |book_comment| %>