app/views/book_comments/_index.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
<td>コメント数：<%= book.book_comments.count %></td>