app/views/books/_index.html.erb

        <td><%= book.body %></td>
      　<td><%= link_to "コメント数：#{book.book_comments.count} ", "book_#{book.id}" %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]