app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @user = current_user
    @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "19"], ["body", "50"], ["user_id", 1], ["created_at", "2021-12-08 10:50:17.426304"], ["updated_at", "2021-12-08 10:50:17.426304"]]