app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "75e3b0e1e0b2225bd86907635bf85ebf54b448d2e200d3ae2ad108ed5367"], ["updated_at", "2021-12-08 10:50:26.674872"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def ensure_correct_user
    @user = User.find(params[:id])